org-content/all-posts.org
# -*- mode: org; mode: visual-line; mode: visual-fill-column; mode: org-hugo-auto-export -*-
#+hugo_section: post/
#+hugo_base_dir: ../
#+export_hugo_weight: auto
#+hugo_auto_set_lastmod: t
#+startup: inlineimages
#+startup: logdone
#+property: header-args:sql :session reporter :exports result :colnames yes  :engine postgresql :results replace table
#+hugo_paired_shortcodes: %table %marginnote %newthought
#+macro: newthought @@hugo:{{% newthought %}}@@$1@@hugo:{{% /newthought %}}@@
#+macro: marginnote @@hugo:{{% marginnote %}}@@$1@@hugo:{{% /marginnote %}}@@
#+macro: sc @@hugo:{{% $1 %}}@@
#+macro: <sc @@hugo:{{< $1 >}}@@

#+seq_todo: TODO DRAFT DONE

** DONE Asshole Free Devil's Advocacy                     :philosophy:blether:
:PROPERTIES:
:export_file_name: devils-advocacy-without-asshattery
:export_hugo_slug: devils-advocacy-without-tears
:export_date: 2018-10-25
:ID:       B96DE889-2A35-4276-B716-EB558186DB55
:END:


So, you want to play Devil's Advocate, but you're afraid you might come across as a bit (or a lot) of an asshole? Here's some suggestions for how to avoid that.

#+hugo: more

*** Maybe don't?
   :PROPERTIES:
   :ID:       DFD8CB3D-98AB-414B-8766-B64DBC5E1D04
   :END:

Seriously, why does the Devil need an advocate? If you want to play DA because you think the position you want to argue has some merit, then argue the position honestly and own it. If it doesn't survive the discussion (or is shouted down), then "Ah right, I hadn't thought of that, you're right" or words to that effect and file that position in your memory as a bad one (along with the skeleton of /why/ it's bad). Nothing wrong with holding strong opinions, the thing that's bad is holding onto them if they're shown to be bad. If the group you're talking with just shouts you down and doesn't convince you that your position is a bad one, maybe find a different group? Or agree with them to steer clear of that topic.

What's really intellectually dishonest is to say "I was only playing Devil's Advocate!" after an idea has been shot down. I'm sure your intentions are entirely honorable, but what if they weren't? Say you genuinely held that the best thing to do with the children of the poor was to turn them into cheap and delicious meals for the richest in society. Say you advanced this position to your friends and were utterly appalled by the idea. Then maybe you'd try to distance yourself from it by saying "Whoah! Guys@@hugo:{{% marginnote %}}@@​ I know. But the kind of people who make this move in an argument are usually the kind of people who'd address a mixed group of folk as "guys".@@hugo:{{% /marginnote %}}@@! I was only playing Devil's Advocate!"

When I hear someone playing that card, how am I supposed to distinguish between the well-meaning "There is this argument I've come across that I'm not sure I agree with, but it maybe has some merit and I don't know how I'd argue convincingly against it" types and the assholes who were flying a kite? Maybe the non-assholes will have friends who'll tell me that "They might seem like a bit of an arse, but they're not really." I've been that guy, and I don't want to be him again. Why is it okay for me to load the work of explaining that I'm not dickhead onto my friends rather than just not acting like a dickhead in the first place? Eventually, friends get tired. Eventually they'll shift to "Yeah, I know he seems like an ass, and he kind of is, but..." and then one day, they won't be your friends any more.

@@hugo:{{% newthought %}}@@Before you introduce the idea@@hugo:{{% /newthought %}}@@ you want to play Devil's Advocate for, say something like "D'you mind if I play Devil's Advocate for a moment?" And when the group tells you "Yes, we do mind. Why help the devil?" listen to them. If it's genuinely that you've heard some argument that on the face of it seems repugnant, but you can't find a hole in it, then say as much: "What's wrong with this idea? Clearly feeding poor babies to the 1% is utterly repellant, but I can't find an effective counterargument."

Don't keep doing it, mind, or you'll start looking like the kite flying asshole again.

